from redis import StrictRedis
#本机
# redisdb=StrictRedis(host='127.0.0.1',
#                     port='6379',
#                     password='66884747',
#                     db=0)
#服务器
redisdb=StrictRedis(host='154.212.112.247',
                    port='19736',
                    password='d4gnmnnykhxmgj0e',
                    db=2)

# for num in range(1005):
#     redisdb.lpush('test_post_data',num)

s_url='http://zhannei.baidu.com/cse/search?q={}&p={}&s=9261166450363232460&srt=lds&sti=43200&nsid=1'

for keyword in ['招聘'
    ,'人才市场','企业人才招聘', '成都人才招聘', '四川人才招聘', '英才招聘','企业招聘', '公司招聘猎头公司',
                '公司职位','猎头公司排名','小微企业招聘','高效招聘','高薪诚聘', '简历投递', '跳槽人力资源', '猎头', '应聘',
                '猎头技巧','简历通讯录','海量简历','猎头服务','知名猎头','代招岗位','顶级猎头','找工作', '专业猎头智联招聘',
                '前程无忧','boss直聘','百度招聘','中华英才网','猎聘','58同城招聘','拉勾网','赶集网招聘','职位搜索','简历投递',
                '立即应聘','薪资透明真实招聘职位', '职位要求','优质人才','海量人才在线','智能匹配合适人才','合适人才快速入职',
                '高效招聘快速入职','快速发布极速招聘','快速到岗','人才推荐','人才筛选','人才储备','应届生招聘','实习生招聘',
                '应届生求职','快速求职通道','招聘大学生','本科招聘销售招聘','市场招聘','财务招聘', '设计师招聘','运营招聘',
                '工程师招聘','行政招聘成都人才网','成都招聘信息','成都招聘网','四川猎头','四川招聘']:
    for page in range(0,2):
        url=s_url.format(keyword,page)
        redisdb.lpush('lc_zhaopin_url',url)
redisdb.close()